Revit 2027 API
DisplacementElement.GetAbsoluteDisplacement Method
 The absolute displacement applied to the displaced elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ GetAbsoluteDisplacement()
Public Function GetAbsoluteDisplacement As XYZ
public:
XYZ^ GetAbsoluteDisplacement()
member GetAbsoluteDisplacement : unit -> XYZ
Return Value
XYZ
 The absolute displacement.
Remarks
 The value is the relative translation of this DisplacementElement plus the relative displacements of all of its ancestor DisplacementElements.
See Also
Reference
DisplacementElement Class
Autodesk.Revit.DB Namespace